IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DCC2.xml
<module name="DCC2" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CFG_DCCGCTRL" acronym="CFG_DCCGCTRL" offset="0x0" width="32" description="Starts / stops the counters. Clears the error signal.">
		<bitfield id="DONEENA" width="4" begin="15" end="12" resetval="0x5" description="The DONEENA bit enables/disables the done interrupt signal, but has no effect on the done status flag in DCCSTAT register. User, privilege, and debug mode (read): 0101 = the done signal is disabled others = the done signal is enabled Privilege and debug mode (write): 0101 = disable done signal generation others = enable done signal generation" range="15 - 12" rwaccess="R/W"/> 
		<bitfield id="SINGLESHOT" width="4" begin="11" end="8" resetval="0x5" description="The SINGLESHOT bit enables/disables repetitive operation of the DCC. User, privilege, and debug mode (read): 1010 = stop counting when counter0 and valid0 both reach zero 1011 = stop counting when counter1 reaches zero others = continuously repeat (until error) Privilege and debug mode (write): 1010 = stop counting when counter0 and valid0 both reach zero 1011 = stop counting when counter1 reaches zero others = continuously repeat (until error)" range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="ERRENA" width="4" begin="7" end="4" resetval="0x5" description="The ERRENA bit enables/disables the error signal. User, privilege, and debug mode (read): 0101 = the error signal is disabled others = the error signal is enabled Privilege and debug mode (write): 0101 = disable error signal generation others = enable error signal generation" range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="DCCENA" width="4" begin="3" end="0" resetval="0x5" description="The DCCENA bit starts and stops the operation of the dcc. User, privilege, and debug mode (read): 0101 = counters are stopped others = counters are running Privilege and debug mode (write): 0101 = stop counters and error-checking others = load the counters with their seed values and begin counting" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_DCCREV" acronym="CFG_DCCREV" offset="0x4" width="32" description="Specifies the module version.">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="User, privilege, and debug mode (read): Returns 01. Privilege and debug mode (write): Writes have no effect." range="31 - 30" rwaccess="R"/> 
		<bitfield id="FUNC" width="12" begin="27" end="16" resetval="0x1" description="Reflects software-compatability. If there is no level of software compatability, a unique func number is assigned; for compatible modules, the same number is maintained. User, privilege, and debug mode (read): 0x0 Privilege and debug mode (write): Writes have no effect." range="27 - 16" rwaccess="R"/> 
		<bitfield id="RTL" width="5" begin="15" end="11" resetval="0x0" description="Incremented for releases due to spec changes or post-release design changes. Reset to 0 when either MAJOR or MINOR is incremented. User, privilege, and debug mode (read): 0x0 Privilege and debug mode (write): Writes have no effect." range="15 - 11" rwaccess="R"/> 
		<bitfield id="MAJOR" width="3" begin="10" end="8" resetval="0x3" description="Represents major changes to the module (e.g. entirely new features are added/changed). The major revision number for this module. User, privilege, and debug mode (read): 0x2 Privilege and debug mode (write): Writes have no effect." range="10 - 8" rwaccess="R"/> 
		<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Indicates a special version of the module. May not be supported by standard software. User, privilege, and debug mode (read): 0x0 Privilege and debug mode (write): Writes have no effect." range="7 - 6" rwaccess="R"/> 
		<bitfield id="MINOR" width="6" begin="5" end="0" resetval="0x0" description="Represents minor changes to the module (e.g. enhancements to existing features). The minor revision number for this module. User, privilege, and debug mode (read): 0x4 Privilege and debug mode (write): Writes have no effect." range="5 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_DCCCNTSEED0" acronym="CFG_DCCCNTSEED0" offset="0x8" width="32" description="Seed value for the counter attached to clock source 0">
		<bitfield id="COUNTSEED0" width="20" begin="19" end="0" resetval="0x0" description="This field contains the seed value that gets loaded into counter 0 (clock source 0). User, privilege, and debug mode (read): Returns the current seed value for counter 0. Privilege and debug mode (write): Sets the current seed value for counter 0." range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_DCCVALIDSEED0" acronym="CFG_DCCVALIDSEED0" offset="0xC" width="32" description="Seed value for the timeout counter attached to clock source 0.">
		<bitfield id="VALIDSEED0" width="16" begin="15" end="0" resetval="0x0" description="This field contains the seed value that gets loaded into the valid duration counter for clock source 0. User, privilege, and debug mode (read): Returns the current seed value for VALID0. Privilege and debug mode (write): Sets the current seed value for VALID0." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_DCCCNTSEED1" acronym="CFG_DCCCNTSEED1" offset="0x10" width="32" description="Seed value for the counter attached to clock source 1.">
		<bitfield id="COUNTSEED1" width="20" begin="19" end="0" resetval="0x0" description="This field contains the seed value that gets loaded into counter 1 (clock source 1). User, privilege, and debug mode (read): Returns the current seed value for counter 1. Privilege and debug mode (write): Sets the current seed value for counter 1." range="19 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_DCCSTAT" acronym="CFG_DCCSTAT" offset="0x14" width="32" description="Specifies the status of the DCC Module.">
		<bitfield id="DONEFLG" width="1" begin="1" end="1" resetval="0x0" description="Indicates when single-shot mode is complete without error. Writing a 1 to this bit clears the flag. User, privilege, and debug mode (read): 0 = single-shot mode is not done 1 = single-shot mode is done Privilege and debug mode (write): 0 = no effect 1 = clear the done flag" range="1" rwaccess="R/W1TC"/> 
		<bitfield id="ERRFLG" width="1" begin="0" end="0" resetval="0x0" description="Indicates whether or not an error has occured. Writing a 1 to this bit clears the flag. User, privilege, and debug mode (read): 0 = an error has not occurred 1 = an error has occurred Privilege and debug mode (write): 0 = no effect 1 = clear the error flag" range="0" rwaccess="R/W1TC"/>
	</register>
	<register id="CFG_DCCCNT0" acronym="CFG_DCCCNT0" offset="0x18" width="32" description="Value of the counter attached to clock source 0.">
		<bitfield id="COUNT0" width="20" begin="19" end="0" resetval="0x0" description="This field contains the current value of counter 0. User, privilege, and debug mode (read): Returns the current value for counter 0. Privilege and debug mode (write): Writes have no effect." range="19 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_DCCVALID0" acronym="CFG_DCCVALID0" offset="0x1C" width="32" description="Value of the valid counter attached to clock source 0.">
		<bitfield id="VALID0" width="16" begin="15" end="0" resetval="0x0" description="This field contains the current value of valid counter 0. User, privilege, and debug mode (read): Returns the current value for valid counter 0. Privilege and debug mode (write): writes have no effect." range="15 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_DCCCNT1" acronym="CFG_DCCCNT1" offset="0x20" width="32" description="Value of the counter attached to clock source 1.">
		<bitfield id="COUNT1" width="20" begin="19" end="0" resetval="0x0" description="This field contains the current value of counter 1. User, privilege, and debug mode (read): Returns the current value for counter 1. Privilege and debug mode (write): writes have no effect." range="19 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_DCCCLKSRC1" acronym="CFG_DCCCLKSRC1" offset="0x24" width="32" description="Selects the clock source for counter 1.">
		<bitfield id="KEY" width="4" begin="15" end="12" resetval="0x0" description="This field enables or disables clock source selection for counter 1. User, privilege, and debug mode (read): Returns the current value of the key. Privilege and debug mode (write): Sets the key value. Key values: 1010: The CLKSRC field selects the clock source for counter 1. others: Clock source selection is disabled. The secondary oscillator (clock source 1) is selected for counter 1." range="15 - 12" rwaccess="R/W"/> 
		<bitfield id="CLKSRC1" width="5" begin="4" end="0" resetval="0x0" description="This field specifies the clock source for counter 1, when the KEY field enables this feature. User, privilege, and debug mode (read): Returns the current value of CLKSRC. Privilege and debug mode (write): Sets the value of CLKSRC." range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_DCCCLKSRC0" acronym="CFG_DCCCLKSRC0" offset="0x28" width="32" description="Selects the clock source for counter 0.">
		<bitfield id="KEY" width="4" begin="15" end="12" resetval="0x0" description="This field enables or disables clock source selection for counter 0. User, privilege, and debug mode (read): Returns the current value of the key. Privilege and debug mode (write): Sets the key value. Key values: 1010: The CLKSRC field selects the clock source for counter 0. others: Clock source selection is disabled. The external oscillator (XTAL) is selected for counter 0." range="15 - 12" rwaccess="R/W"/> 
		<bitfield id="CLKSRC0" width="4" begin="3" end="0" resetval="0x0" description="This field specifies the clock source for counter 0. User, privilege, and debug mode (read): Returns the current value of CLKSRC0. Privilege and debug mode (write): Sets the value of CLKSRC0." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_DCCGCTRL2" acronym="CFG_DCCGCTRL2" offset="0x2C" width="32" description="Allows configuring different modes of operation for DCC.">
		<bitfield id="FIFO_NONERR" width="4" begin="11" end="8" resetval="0x5" description="Enables/disables FIFO writes without the error event on completion of comparison window. User, privilege, and debug mode (read): Returns the current field value. Privilege and debug mode (write): Sets the value of field value. Source values: 0101: Counter values are captured to non-full FIFO only upon Error event. Others: Write counter values to non-full FIFO upon completion of comparison window regardless of error or not." range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="FIFO_READ" width="4" begin="7" end="4" resetval="0x5" description="Enables the counter read registers reflect FIFO output instead of the live counter value. User, privilege, and debug mode (read): Returns the current field value. Privilege and debug mode (write): Sets the value of field value. Source values: 0101: Counter value is read directly. Others: Counters FIFO output is read." range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="CONT_ON_ERR" width="4" begin="3" end="0" resetval="0x5" description="Continues to next window of comparison despite the error condition. User, privilege, and debug mode (read): Returns the current field value. Privilege and debug mode (write): Sets the value of field value. Enable values: 0101: Comparison and counter reload is stopped from advancing if error is detected. Others: Counters get reloaded with seed and continue counting despite the error condition." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_DCCSTATUS2" acronym="CFG_DCCSTATUS2" offset="0x30" width="32" description="Specifies the status of the DCC FIFOs.">
		<bitfield id="COUNT1_FIFO_FULL" width="1" begin="5" end="5" resetval="0x0" description="Count1 FIFO Full. Indicates whether Count1 FIFO is full. User, privilege, and debug mode (read): 0: Count1 FIFO is not full 1: Count1 FIFO is full. Privilege and debug mode (write): Writes have no effect." range="5" rwaccess="R"/> 
		<bitfield id="VALID0_FIFO_FULL" width="1" begin="4" end="4" resetval="0x0" description="Valid0 FIFO Full. Indicates whether Valid0 FIFO is full. User, privilege, and debug mode (read): 0: Valid0 FIFO is not full 1: Valid0 FIFO is full. Privilege and debug mode (write): Writes have no effect." range="4" rwaccess="R"/> 
		<bitfield id="COUNT0_FIFO_FULL" width="1" begin="3" end="3" resetval="0x0" description="Count0 FIFO Full. Indicates whether Count0 FIFO is full. User, privilege, and debug mode (read): 0: Count0 FIFO is not full 1: Count0 FIFO is full. Privilege and debug mode (write): Writes have no effect." range="3" rwaccess="R"/> 
		<bitfield id="COUNT1_FIFO_EMPTY" width="1" begin="2" end="2" resetval="0x1" description="Count1 FIFO Empty. Indicates whether Count1 FIFO is empty. User, privilege, and debug mode (read): 0: Count1 FIFO is not empty 1: Count1 FIFO is empty. Privilege and debug mode (write): Writes have no effect." range="2" rwaccess="R"/> 
		<bitfield id="VALID0_FIFO_EMPTY" width="1" begin="1" end="1" resetval="0x1" description="Valid0 FIFO Empty. Indicates whether Valid0 FIFO is empty. User, privilege, and debug mode (read): 0: Valid0 FIFO is not empty 1: Valid0 FIFO is empty. Privilege and debug mode (write): Writes have no effect." range="1" rwaccess="R"/> 
		<bitfield id="COUNT0_FIFO_EMPTY" width="1" begin="0" end="0" resetval="0x1" description="Count0 FIFO Empty. Indicates whether Count0 FIFO is empty. User, privilege, and debug mode (read): 0: Count0 FIFO is not empty 1: Count0 FIFO is empty. Privilege and debug mode (write): Writes have no effect." range="0" rwaccess="R"/>
	</register>
	<register id="CFG_DCCERRCNT" acronym="CFG_DCCERRCNT" offset="0x34" width="32" description="Counts number of errors since last clear.">
		<bitfield id="ERRCNT" width="10" begin="9" end="0" resetval="0x0" description="Counts the number of errors after the last write to this register or reset. If reached terminal count the count freezes. User needs to clear it." range="9 - 0" rwaccess="R/W"/>
	</register>
</module>